const title = document.querySelector(".main h1"),
	btn = document.querySelector(".main button"),
	hideParagraph = document.querySelector(".main p");

let isHide = true;

const DATA = [
	// "+998 91 343 0668",
	// "+998 90 695 0451",
	// "+998 91 185 8424",
	// "+998 94 007 2207",
	// "+998 91 293 3164",
	// "+998 93 409 1208",
	// "+998 94 504 2207",
	// "закон",
	// "статья",
	// "адвокат",
	// "ловить мячь",
	// "пинать мячь",
	// "нести мячь",
	// "играть мячь головой",
	// "бросать мячь",
	// "бить мячь",
	// "катать мячь",
	// "держать мячь",
	// "првила",
	// "линия",
	// "ракета",
	// "потом/затем",
	// "коменда",
	// "оброщать внимания",
	// "гадать",
	// "игроки",
	// "шайба",
	// "шлем",
	// "очередь",
	// "перчатки",
	// "слушать",
	// "знаменитый",
	// "родиться",
	// "художник",
	// "танцор",
	// "создатель/изобретатель",
	// "писатель",
	// "учённый",
	// "узновать",
	// "рисовать",
	// "обнаружение",
	// "певец",
	// "спортсмен",
	// "астроном",
	// "королева",
	// "музыкант",
	// "занятие/профессия",
	"прошлый",
	"играть",
	"использовать",
	"космос",
	"ходить на лыжах",
	"гора",
	"ездить на велосипеде",
	"проверять",
	"спрашивать",
	"отвечать",
	"любить",
	"выбирать",
	"делать",
	"о/про",
	"путиществие",
	"выходные",
	"звонить/телефон",
	"вопрос",
	"должить",
	"кино"
];

btn.addEventListener("click", () => {
	btn.style.display = "none";
	let interval = setInterval(() => {
		let index = Math.floor(Math.random() * DATA.length);
		title.innerHTML = `${DATA[index]}`;
	}, 1000);

	setTimeout(() => {
		clearInterval(interval);
		btn.style.display = "inline-block";
	}, 1000);
});

hideParagraph.addEventListener("click", () => {
	isHide = !isHide;
	if (isHide == true) {
		hideParagraph.classList.remove("hide");
	} else {
		hideParagraph.classList.add("hide");
	}
});
